# Pandas week 3

# 9. Membagi Data Frame menjadi dua secara acak

In [28]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [29]:
#Data Frame Prep
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,25, size=(n_rows, n_cols)),
                 columns=cols)

df

    A   B   C   D   E
0   4   3  15   5  10
1   6   6  10  14  10
2  15   5  12   4  22
3  21  24  10   7   9
4  16  20  22  16  12
5  23   9  12  17   9
6  12   1  19   5   4
7  12  18   1   4  19
8  12  10  24  23  18
9  19  13  13  15  18

# Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [30]:
df.shape#menghitung jumlas baris dan kolom (kanan baris dan kiri kolom )

(10, 5)

In [31]:
#membagi data Frame
proporsi= 0.8 #80% data pertama dan sisanya untuk data kedua
df_1 = df.sample(frac=proporsi)
#df.sample(): method yang mengambil baris secara acak sesuai nilai parameter fracnya
df_2 = df.drop(df_1.index)#--> isinya menghapus baris yang sudah ada di df_1 (sisa data dari df_1)

print(f'df_1shape: {df_1.shape}')
print(f'df_2shape: {df_2.shape}')

df_1shape: (8, 5)
df_2shape: (2, 5)

In [32]:
# isi df_1
df_1

    A   B   C   D   E
3  21  24  10   7   9
9  19  13  13  15  18
1   6   6  10  14  10
5  23   9  12  17   9
2  15   5  12   4  22
0   4   3  15   5  10
4  16  20  22  16  12
8  12  10  24  23  18

In [33]:
#isi df_2
df_2

    A   B   C  D   E
6  12   1  19  5   4
7  12  18   1  4  19